Bucknalla/micropython/ports/efm32/boards/fin/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "gecko"
#define MICROPY_HW_MCU_NAME "efr32bg1b"

